Revit 2026 API

# HVACLoadTypePlenumLighting Property

---

The percentage of plenum lighting contribution.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PlenumLighting { get; set; }
```
```vb
Public Property PlenumLighting As Double
	Get
	Set
```
```cpp
public:
property double PlenumLighting {
	double get ();
	void set (double value);
}
```
```fsharp
member PlenumLighting : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The value should be between [0.0,1.0]. |

#### Reference

HVACLoadType Class

Autodesk.Revit.DB.Analysis Namespace